java-test-samples/fargate-dynamodb-sync/load-tests/Loadtest.yaml
config:

  target: 'http://<<HOST_IP_ADDRESS>>' #replace the url of the api endpoint as given by business
  
  phases:

    - name: PerfLoadTest
      duration: 60
      arrivalCount: 2
      
      
  defaults:
    headers:
      Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
      Accept-Encoding: gzip, deflate, br
      User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36
      Host: <<HOST_IP_ADDRESS>>
      Upgrade-Insecure-Requests: 1

scenarios:
  - flow:
      - get:
          url: '/customers?customerId=124'
          capture:
                - json: "$.name"
                  as: "name"
                - json: "$.customerId"
                  as: "customerid"
                - json: "$.email"
                  as: "email"